&НаСервере
Процедура ЗаполнитьПоДаннымБухучетаНаСервере() Экспорт
	
	Соединение = Новый ПараметрыСоединенияВнешнегоИсточникаДанных;
	Соединение.АутентификацияОС = Ложь;
	Соединение.СтрокаСоединения= "DRIVER={SQL Server};SERVER=172.22.130.197;UID=sa;PWD=Abc10201030;DATABASE=Filippov_1";
	Соединение.ИмяПользователя = "sa";
	Соединение.Пароль = "Abc10201030";
	ВнешнийИсточник = ВнешниеИсточникиДанных.БухгалтерияПредприятия30;
	ВнешнийИсточник.УстановитьОбщиеПараметрыСоединения(Соединение);
	ВнешнийИсточник.УстановитьПараметрыСоединенияСеанса(Соединение);
	ВнешнийИсточник.УстановитьСоединение();

	СчетКассы = ВнешниеИсточникиДанных.БухгалтерияПредприятия30.Таблицы.ПланСчетов.НайтиПоПолю("Код", "50.01");	

	СчетБанка = ВнешниеИсточникиДанных.БухгалтерияПредприятия30.Таблицы.ПланСчетов.НайтиПоПолю("Код", "51");
	
	//НачалоПериодаКасса
	ЗапросОстатки = Новый Запрос;
	ЗапросОстатки.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Хозрасчетный_ИтогиПоСчетам.НачОстатокСумма КАК НачОстатокСумма,
	|	Хозрасчетный_ИтогиПоСчетам.ОборотСумма КАК ОборотСумма,
	|	Хозрасчетный_ИтогиПоСчетам.Счет КАК Счет,
	|	ДОБАВИТЬКДАТЕ(Хозрасчетный_ИтогиПоСчетам.Период, МЕСЯЦ, -24000) КАК Период
	|ИЗ
	|	ВнешнийИсточникДанных.БухгалтерияПредприятия30.Таблица.Хозрасчетный_ИтогиПоСчетам КАК Хозрасчетный_ИтогиПоСчетам
	|ГДЕ
	|	Хозрасчетный_ИтогиПоСчетам.Счет = &Счет
	|	И Хозрасчетный_ИтогиПоСчетам.Организация = &Организация
	|	И ДОБАВИТЬКДАТЕ(Хозрасчетный_ИтогиПоСчетам.Период, МЕСЯЦ, -24000) <= &НачПериода
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	ЗапросОстатки.УстановитьПараметр("Счет", СчетКассы);
	ЗапросОстатки.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	ЗапросОстатки.УстановитьПараметр("НачПериода", НачалоМесяца(ЭтотОбъект.НачПериода));
	
	РезультатОстатки = ЗапросОстатки.Выполнить();
	ВыборкаОстатки = РезультатОстатки.Выбрать();
	
	Если  ВыборкаОстатки.Следующий() Тогда
	    НачОстаток = ВыборкаОстатки.НачОстатокСумма;
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Хозрасчетный.СчетДт КАК Счет,
			|	СУММА(Хозрасчетный.Сумма) КАК СуммаДТ,
			|	СУММА(0) КАК СуммаКТ
			|ИЗ
			|	ВнешнийИсточникДанных.БухгалтерияПредприятия30.Таблица.Хозрасчетный КАК Хозрасчетный
			|ГДЕ
			|	Хозрасчетный.СчетДт = &Счет
			|	И Хозрасчетный.Организация = &Организация
			|	И ДОБАВИТЬКДАТЕ(Хозрасчетный.Период, МЕСЯЦ, -24000) МЕЖДУ &НачалоПериода И НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
			|
			|СГРУППИРОВАТЬ ПО
			|	Хозрасчетный.СчетДт
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Хозрасчетный.СчетКт,
			|	СУММА(0),
			|	СУММА(Хозрасчетный.Сумма)
			|ИЗ
			|	ВнешнийИсточникДанных.БухгалтерияПредприятия30.Таблица.Хозрасчетный КАК Хозрасчетный
			|ГДЕ
			|	Хозрасчетный.СчетКт = &Счет
			|	И Хозрасчетный.Организация = &Организация
			|	И ДОБАВИТЬКДАТЕ(Хозрасчетный.Период, МЕСЯЦ, -24000) МЕЖДУ &НачалоПериода И НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
			|
			|СГРУППИРОВАТЬ ПО
			|	Хозрасчетный.СчетКт";
	 
		Запрос.УстановитьПараметр("КонецПериода", ЭтотОбъект.НачПериода);
		Запрос.УстановитьПараметр("НачалоПериода", ВыборкаОстатки.Период);
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("Счет", СчетКассы);
	
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НачОстаток = НачОстаток + ВыборкаДетальныеЗаписи.СуммаДт - ВыборкаДетальныеЗаписи.СуммаКт; 
		КонецЦикла;	
		ЭтотОбъект.ОстатокСредствНаНачалоПериодаВКассе = НачОстаток;
	Иначе
		
		ЭтотОбъект.ОстатокСредствНаНачалоПериодаВКассе = 0;
	
	КонецЕсли;
	//НачалоПериодаКасса  конец

	//НачалоПериодаБанк	
	ЗапросОстатки = Новый Запрос;
	ЗапросОстатки.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Хозрасчетный_ИтогиПоСчетам.НачОстатокСумма КАК НачОстатокСумма,
	|	Хозрасчетный_ИтогиПоСчетам.ОборотСумма КАК ОборотСумма,
	|	Хозрасчетный_ИтогиПоСчетам.Счет КАК Счет,
	|	ДОБАВИТЬКДАТЕ(Хозрасчетный_ИтогиПоСчетам.Период, МЕСЯЦ, -24000) КАК Период
	|ИЗ
	|	ВнешнийИсточникДанных.БухгалтерияПредприятия30.Таблица.Хозрасчетный_ИтогиПоСчетам КАК Хозрасчетный_ИтогиПоСчетам
	|ГДЕ
	|	Хозрасчетный_ИтогиПоСчетам.Счет = &Счет
	|	И Хозрасчетный_ИтогиПоСчетам.Организация = &Организация
	|	И ДОБАВИТЬКДАТЕ(Хозрасчетный_ИтогиПоСчетам.Период, МЕСЯЦ, -24000) <= &НачПериода
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	ЗапросОстатки.УстановитьПараметр("Счет", СчетБанка);
	ЗапросОстатки.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	ЗапросОстатки.УстановитьПараметр("НачПериода", НачалоМесяца(ЭтотОбъект.НачПериода));
	
	РезультатОстатки = ЗапросОстатки.Выполнить();
	ВыборкаОстатки = РезультатОстатки.Выбрать();
	
	Если  ВыборкаОстатки.Следующий() Тогда
	    НачОстаток = ВыборкаОстатки.НачОстатокСумма;
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Хозрасчетный.СчетДт КАК Счет,
			|	СУММА(Хозрасчетный.Сумма) КАК СуммаДТ,
			|	СУММА(0) КАК СуммаКТ
			|ИЗ
			|	ВнешнийИсточникДанных.БухгалтерияПредприятия30.Таблица.Хозрасчетный КАК Хозрасчетный
			|ГДЕ
			|	Хозрасчетный.СчетДт = &Счет
			|	И Хозрасчетный.Организация = &Организация
			|	И ДОБАВИТЬКДАТЕ(Хозрасчетный.Период, МЕСЯЦ, -24000) МЕЖДУ &НачалоПериода И НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
			|
			|СГРУППИРОВАТЬ ПО
			|	Хозрасчетный.СчетДт
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Хозрасчетный.СчетКт,
			|	СУММА(0),
			|	СУММА(Хозрасчетный.Сумма)
			|ИЗ
			|	ВнешнийИсточникДанных.БухгалтерияПредприятия30.Таблица.Хозрасчетный КАК Хозрасчетный
			|ГДЕ
			|	Хозрасчетный.СчетКт = &Счет
			|	И Хозрасчетный.Организация = &Организация
			|	И ДОБАВИТЬКДАТЕ(Хозрасчетный.Период, МЕСЯЦ, -24000) МЕЖДУ &НачалоПериода И НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
			|
			|СГРУППИРОВАТЬ ПО
			|	Хозрасчетный.СчетКт";
	 
		Запрос.УстановитьПараметр("КонецПериода", ЭтотОбъект.НачПериода);
		Запрос.УстановитьПараметр("НачалоПериода", ВыборкаОстатки.Период);
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("Счет", СчетБанка);
	
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НачОстаток = НачОстаток + ВыборкаДетальныеЗаписи.СуммаДт - ВыборкаДетальныеЗаписи.СуммаКт; 
		КонецЦикла;	
		ЭтотОбъект.ОстатокСредствНаНачалоПериодаВБанке = НачОстаток;
	Иначе		
		ЭтотОбъект.ОстатокСредствНаНачалоПериодаВБанке = 0;
	КонецЕсли;
	//НачалоПериодаБанк Конец
	
	ЭтотОбъект.ОстатокСредствНаНачалоПериодаИтого = ЭтотОбъект.ОстатокСредствНаНачалоПериодаВБанке + ЭтотОбъект.ОстатокСредствНаНачалоПериодаВКассе;
	
	//КонецПериодаКасса
	ЗапросОстатки = Новый Запрос;
	ЗапросОстатки.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Хозрасчетный_ИтогиПоСчетам.НачОстатокСумма КАК НачОстатокСумма,
	|	Хозрасчетный_ИтогиПоСчетам.ОборотСумма КАК ОборотСумма,
	|	Хозрасчетный_ИтогиПоСчетам.Счет КАК Счет,
	|	ДОБАВИТЬКДАТЕ(Хозрасчетный_ИтогиПоСчетам.Период, МЕСЯЦ, -24000) КАК Период
	|ИЗ
	|	ВнешнийИсточникДанных.БухгалтерияПредприятия30.Таблица.Хозрасчетный_ИтогиПоСчетам КАК Хозрасчетный_ИтогиПоСчетам
	|ГДЕ
	|	Хозрасчетный_ИтогиПоСчетам.Счет = &Счет
	|	И Хозрасчетный_ИтогиПоСчетам.Организация = &Организация
	|	И ДОБАВИТЬКДАТЕ(Хозрасчетный_ИтогиПоСчетам.Период, МЕСЯЦ, -24000) <= &НачПериода
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	ЗапросОстатки.УстановитьПараметр("Счет", СчетКассы);
	ЗапросОстатки.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	ЗапросОстатки.УстановитьПараметр("НачПериода", НачалоМесяца(ЭтотОбъект.КонПериода));
	
	РезультатОстатки = ЗапросОстатки.Выполнить();
	ВыборкаОстатки = РезультатОстатки.Выбрать();
	
	Если  ВыборкаОстатки.Следующий() Тогда
	    НачОстаток = ВыборкаОстатки.НачОстатокСумма;
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Хозрасчетный.СчетДт КАК Счет,
			|	СУММА(Хозрасчетный.Сумма) КАК СуммаДТ,
			|	СУММА(0) КАК СуммаКТ
			|ИЗ
			|	ВнешнийИсточникДанных.БухгалтерияПредприятия30.Таблица.Хозрасчетный КАК Хозрасчетный
			|ГДЕ
			|	Хозрасчетный.СчетДт = &Счет
			|	И Хозрасчетный.Организация = &Организация
			|	И ДОБАВИТЬКДАТЕ(Хозрасчетный.Период, МЕСЯЦ, -24000) МЕЖДУ &НачалоПериода И КОНЕЦПЕРИОДА(&КонецПериода, День)
			|
			|СГРУППИРОВАТЬ ПО
			|	Хозрасчетный.СчетДт
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Хозрасчетный.СчетКт,
			|	СУММА(0),
			|	СУММА(Хозрасчетный.Сумма)
			|ИЗ
			|	ВнешнийИсточникДанных.БухгалтерияПредприятия30.Таблица.Хозрасчетный КАК Хозрасчетный
			|ГДЕ
			|	Хозрасчетный.СчетКт = &Счет
			|	И Хозрасчетный.Организация = &Организация
			|	И ДОБАВИТЬКДАТЕ(Хозрасчетный.Период,МЕСЯЦ, -24000) МЕЖДУ &НачалоПериода И КОНЕЦПЕРИОДА(&КонецПериода, День)
			|
			|СГРУППИРОВАТЬ ПО
			|	Хозрасчетный.СчетКт";
	 
		Запрос.УстановитьПараметр("КонецПериода", ЭтотОбъект.КонПериода);
		Запрос.УстановитьПараметр("НачалоПериода", ВыборкаОстатки.Период);
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("Счет", СчетКассы);
	
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НачОстаток = НачОстаток + ВыборкаДетальныеЗаписи.СуммаДт - ВыборкаДетальныеЗаписи.СуммаКт; 
		КонецЦикла;	
		ЭтотОбъект.ОстатокСредствНаДатуОтчетаВКассе = НачОстаток;
	Иначе
		
		ЭтотОбъект.ОстатокСредствНаНачалоПериодаВКассе = 0;
	
	КонецЕсли;
	//КонецПериодаКасса  конец

	//КонецПериодаБанк	
	ЗапросОстатки = Новый Запрос;
	ЗапросОстатки.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Хозрасчетный_ИтогиПоСчетам.НачОстатокСумма КАК НачОстатокСумма,
	|	Хозрасчетный_ИтогиПоСчетам.ОборотСумма КАК ОборотСумма,
	|	Хозрасчетный_ИтогиПоСчетам.Счет КАК Счет,
	|	ДОБАВИТЬКДАТЕ(Хозрасчетный_ИтогиПоСчетам.Период, МЕСЯЦ, -24000) КАК Период
	|ИЗ
	|	ВнешнийИсточникДанных.БухгалтерияПредприятия30.Таблица.Хозрасчетный_ИтогиПоСчетам КАК Хозрасчетный_ИтогиПоСчетам
	|ГДЕ
	|	Хозрасчетный_ИтогиПоСчетам.Счет = &Счет
	|	И Хозрасчетный_ИтогиПоСчетам.Организация = &Организация
	|	И ДОБАВИТЬКДАТЕ(Хозрасчетный_ИтогиПоСчетам.Период,МЕСЯЦ, -24000) <= &НачПериода
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	ЗапросОстатки.УстановитьПараметр("Счет", СчетБанка);
	ЗапросОстатки.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	ЗапросОстатки.УстановитьПараметр("НачПериода", НачалоМесяца(ЭтотОбъект.КонПериода));
	
	РезультатОстатки = ЗапросОстатки.Выполнить();
	ВыборкаОстатки = РезультатОстатки.Выбрать();
	
	Если  ВыборкаОстатки.Следующий() Тогда
	    НачОстаток = ВыборкаОстатки.НачОстатокСумма;
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Хозрасчетный.СчетДт КАК Счет,
			|	СУММА(Хозрасчетный.Сумма) КАК СуммаДТ,
			|	СУММА(0) КАК СуммаКТ
			|ИЗ
			|	ВнешнийИсточникДанных.БухгалтерияПредприятия30.Таблица.Хозрасчетный КАК Хозрасчетный
			|ГДЕ
			|	Хозрасчетный.СчетДт = &Счет
			|	И Хозрасчетный.Организация = &Организация
			|	И ДОБАВИТЬКДАТЕ(Хозрасчетный.Период,МЕСЯЦ, -24000) МЕЖДУ &НачалоПериода И КОНЕЦПЕРИОДА(&КонецПериода, День)
			|
			|СГРУППИРОВАТЬ ПО
			|	Хозрасчетный.СчетДт
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Хозрасчетный.СчетКт,
			|	СУММА(0),
			|	СУММА(Хозрасчетный.Сумма)
			|ИЗ
			|	ВнешнийИсточникДанных.БухгалтерияПредприятия30.Таблица.Хозрасчетный КАК Хозрасчетный
			|ГДЕ
			|	Хозрасчетный.СчетКт = &Счет
			|	И Хозрасчетный.Организация = &Организация
			|	И ДОБАВИТЬКДАТЕ(Хозрасчетный.Период, МЕСЯЦ, -24000) МЕЖДУ &НачалоПериода И КОНЕЦПЕРИОДА(&КонецПериода, День)
			|
			|СГРУППИРОВАТЬ ПО
			|	Хозрасчетный.СчетКт";
	 
		Запрос.УстановитьПараметр("КонецПериода", ЭтотОбъект.КонПЕриода);
		Запрос.УстановитьПараметр("НачалоПериода", ВыборкаОстатки.Период);
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("Счет", СчетБанка);
	
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НачОстаток = НачОстаток + ВыборкаДетальныеЗаписи.СуммаДт - ВыборкаДетальныеЗаписи.СуммаКт; 
		КонецЦикла;	
		ЭтотОбъект.ОстатокСредствНаДатуОтчетаВБанке = НачОстаток;
	Иначе		
		ЭтотОбъект.ОстатокСредствНаДатуОтчетаВБанке = 0;
	КонецЕсли;
	//НачалоПериодаБанк Конец

	ЭтотОбъект.ОстатокСредствНаДатуОтчетаИтого =  ЭтотОбъект.ОстатокСредствНаДатуОтчетаВБанке + ЭтотОбъект.ОстатокСредствНаДатуОтчетаВКассе;
	//НовыйЯщик = Справочники.Храм_Ящики_и_Кружки.СоздатьЭлемент();
	//НовыйЯщик.Наименование = Строка(ЭтотОбъект.ОстатокСредствНаДатуОтчетаИтого) + " " + Строка(ЭтотОбъект.ОстатокСредствНаДатуОтчетаВБанке) + Строка(ЭтотОбъект.ОстатокСредствНаДатуОтчетаВКассе);
	//НовыйЯщик.Записать();
КонецПроцедуры
