
Процедура УстановитьМинимальныеПоляПечати(ТабличныйДокумент) Экспорт
	//ПечатьТорговыхДокументов.УстановитьМинимальныеПоляПечати(ТабДокумент);
КонецПроцедуры

Функция МакетПечатнойФормы(ПутьКМакету) Экспорт
	//УправлениеПечатью.МакетПечатнойФормы();
КонецФункции

Процедура ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Ссылка) Экспорт
	//УправлениеПечатью.ЗадатьОбластьПечатиДокумента();	
КонецПроцедуры

Функция НужноПечататьМакет(КоллекцияПечатныхФорм, ИмяМакета) Экспорт
	//УправлениеПечатью.НужноПечататьМакет();
КонецФункции	

Процедура ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета, СинонимМакета, ТабличныйДокумент,
	Картинка = Неопределено, ПолныйПутьКМакету = "", ИмяФайлаПечатнойФормы = Неопределено) Экспорт
	//УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию();
КонецПроцедуры	

Функция СведенияОЮрФизЛице(Компания, Период = '00010101', Знач БанковскийСчет = Неопределено, ПлатежВБюджет = Ложь) Экспорт
	//БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице();
КонецФункции

Функция ОписаниеОрганизации(СписокСведений, Список = "", СПрефиксом = Истина) Экспорт
 //ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации();	
КонецФункции	

Функция ПроверитьВыводТабличногоДокумента(ТабДокумент, ВыводимыеОбласти, РезультатПриОшибке = Истина) Экспорт
	//ОбщегоНазначенияБПВызовСервера.ПроверитьВыводТабличногоДокумента();
КонецФункции

Функция НомерНаПечать(Знач НомерОбъекта, УдалитьПрефиксИнформационнойБазы = Ложь, УдалитьПользовательскийПрефикс = Ложь) Экспорт
	
//ПрефиксацияОбъектовКлиентСервер.НомерНаПечать();	
	
КонецФункции