
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ф = туту();
	ф.записать("D:\lll");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	   КонецПроцедуры

	   функция туту()
		   
		  Запрос = Новый Запрос;
	   Запрос.Текст = "ВЫБРАТЬ
	   |	dbo_Config.BinaryData КАК BinaryData
	   |ИЗ
	   |	ВнешнийИсточникДанных.ВнешнийИсточникДанных1.Таблица.dbo_Config КАК dbo_Config
	   |ГДЕ
	   |	dbo_Config.FileName = &FileName";
	   
	   Запрос.УстановитьПараметр("FileName", запись.FileName);
	   
	   Результат = Запрос.Выполнить();
	   тз = Результат.Выгрузить();  
	   
	 возврат тз[0].BinaryData;
	

 
		   
		   
	   КонецФункции
	   