
&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Ключ", Расшифровка);
	
	ТипДокумента = ПолучитьТипДокумента(Расшифровка);	
	Если ТипДокумента <> "" тогда			
		ОткрытьФОрму("ВнешнийИсточникДанных.БухгалтерияПредприятия30.Таблица."+ТипДокумента+".ФормаОбъекта", ПараметрыФОрмы); 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТабДок.Вывести(ЭтотОбъект.Параметры.ПЕчатнаяФОрма);
КонецПроцедуры

&НаСервере
Функция ПолучитьТипДокумента(Расшифровка)
	Массив = ОбщегоНазначения.РазложитьСтрокуНаПодстроки(Строка(Расшифровка), "0");
	Если Массив[0] = "Списание с расчетного счета" тогда 
		Возврат "СписаниеСРасчетногоСчета";
	ИначеЕсли Массив[0] = "Выдача наличных №" тогда 
		Возврат "РасходныйКассовыйОрдер";
	ИначеЕсли Массив[0] = "Поступление наличных №" тогда
		Возврат "ПриходныйКассовыйОрдер";
	ИначеЕсли Массив[0] = "Поступление на расчетный счет №" тогда
		Возврат "ПоступлениеНаРасчетныйСчет";
	Иначе
		Возврат "";
	КонецЕсли;	
КонецФункции	